Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.RequestSystemsAnalysis(Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions)
Requests a new systems analysis in the background.
options:
The additional options to run systems analysis. If empty, use the default value in the view element.
The request may download the weather file at current site location if not specified in the options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A valid energy model is required for systems analysis.
Since:
2020.1